# 标识符规定:
# 1.只能由数字、字母、_(下划线)组成
# 2.不能以数字开头
# 3.不能是关键字
# 4.严格区分大小写

# 1.只能由数字、字母、_(下划线)组成
# 2.不能以数字开头
# 3.不能是关键字
# 4.严格区分大小写

# Python3可以用中文命名，但是不推荐，不符合代码的规范性

(user) = 1
print((user)) # 输出user变量的值
#标识符对包含在()内对标识符本身没有影响

# 标识符命名规范:

# 1.见名知义
name = "张三" # 定义一个字符串变量并赋值为“张三”
# 2.下划线分割法:
user_name = "李四" # 定义一个字符串变量并赋值为“李四”
# 多个单词组成的名称，使用小写字母，单词与单词之间使用下
# 划线分开。
# 3.大驼峰命名法:
UserName = "王五" # 定义一个字符串变量并赋值为“王五”
# 多个单词组成的名称，每个单词的首字母大写，其余字母小写。
# 4.小驼峰命名法:
userName = "赵六" # 定义一个字符串变量并赋值为“赵六”
# 第一个单词首字母小写，后面单词首字母大写，其余字母小写。

